tariff=int(input('Введіть ваш тариф(1000,2000,5000): '))
MB=int(input('Введіть вашу кількість використаних мегабайтів: '))
Rahunok=0
if tariff == 1000:
    mb=MB-1000
    if mb>=0:
        Rahunok=20+(mb*0.05)
        print('Ваш рахунок за місяць ' + str(Rahunok)+' ГРН')
    else:
        print('Ваш рахунок за місяць ' + str(20)+' ГРН')
    if (MB-2000)>=0:
        print('Якби ваш тарифний план був 2000 то ваша рахунок був би '+ str(35+((MB-2000)*0.04)) + ' ГРН')
    else:
        print('Якби ваш тарифний план був 2000 то ваша рахунок був би '+ str(35)+ ' ГРН')
    if(MB-5000)>=0:
         print('Якби ваш тарифний план був 5000 то ваша рахунок був би '+ str(85+((MB-5000)*0.02))+ ' ГРН')
    else:
         print('Якби ваш тарифний план був 5000 то ваша рахунок був би '+ str(85)+ ' ГРН')
if tariff == 2000:
    mb=MB-2000
    if mb>=0:
        Rahunok=35+(mb*0.04)
        print('Ваш рахунок за місяць ' + str(Rahunok)+' ГРН')
    else:
        print('Ваш рахунок за місяць ' + str(35)+' ГРН')
    if(MB-5000)>0:
         print('Якби ваш тарифний план був 5000 то ваша рахунок був би '+ str(85+((MB-5000)*0.02))+ ' ГРН')
    else:
         print('Якби ваш тарифний план був 5000 то ваша рахунок був би '+ str(85)+ ' ГРН')
if tariff == 5000:
    mb=MB-5000
    if mb>0:
        Rahunok=85+(mb*0.02)
        print('Ваш рахунок за місяць ' + str(Rahunok)+' ГРН')
    else:
        print('Ваш рахунок за місяць ' + str(85)+' ГРН')  
import datetime
def printTimeStamp(name):
  print('Автор програми: ' + name)
  print('Час компіляції: ' + str(datetime.datetime.now()))
printTimeStamp('Кучерук Євгеній')
   
